
## Plan Result

[CI link](https://github.com/YumNumm/rx2530-infra/actions/runs/15774420455)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * lxd_instance.common


<details><summary>Change Result (Click me)</summary>

```hcl

  # lxd_instance.common will be created
  + resource "lxd_instance" "common" {
      + allow_restart    = false
      + config           = {
          + "cloud-init.user-data" = <<-EOT
                #cloud-config
                
                apt:
                  sources:
                    fish-shell:
                      source: ppa:fish-shell/release-4
                
                package_update: true
                package_upgrade: true
                
                packages:
                  - curl
                  - wget
                  - git
                  - htop
                  - unzip
                  - software-properties-common
                  - apt-transport-https
                  - ca-certificates
                  - gnupg
                  - lsb-release
                  - language-pack-ja-base
                  - language-pack-ja
                  - fish
                
                timezone: Asia/Tokyo
                locale: ja_JP.UTF-8
                
                users:
                  - name: yumnumm
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh_import_id: github:yumnumm
                
                runcmd:
                  # install fisher
                  - >-
                    sudo -H -u yumnumm fish -c
                      "curl -sL https://raw.githubusercontent.com/jorgebucaran/fisher/main/functions/fisher.fish | source &&
                      fisher install jorgebucaran/fisher"
                  # install fisher plugin: tide
                  - >-
                    sudo -H -u yumnumm fish -c
                      "fisher install IlanCosman/tide@v6"
                
                final_message: "Cloud-init setup completed successfully"
            EOT
          + "raw.idmap"            = "both 1000 1000"
          + "security.nesting"     = "true"
        }
      + description      = "Common instance with basic setup"
      + ephemeral        = false
      + image            = "ubuntu:24.04"
      + interfaces       = (known after apply)
      + ipv4_address     = (known after apply)
      + ipv6_address     = (known after apply)
      + limits           = {
          + "cpu"    = "4"
          + "memory" = "4GiB"
        }
      + location         = (known after apply)
      + mac_address      = (known after apply)
      + name             = "common"
      + profiles         = [
          + "default",
        ]
      + running          = true
      + status           = (known after apply)
      + type             = "container"
      + wait_for_network = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"cc955a4607e7ce68f680afa4ce958aac84861955","Vars":{},"WorkflowName":"Terraform Plan"} -->